rails/app/controllers/activities_controller.rb

SELECT * FROM "activities"
---
  def index
    @activities = Activity.all

SELECT * FROM "activities" WHERE ("activities"."id" = 1)
---
  def show
    @activity = Activity.find(params[:id])

SELECT * FROM "activities" WHERE ("activities"."id" = 1)
---
  def edit
    @activity = Activity.find(params[:id])

INSERT INTO "activities" ("title", "created_at", "updated_at") VALUES('Running and jumping', '2010-06-25 18:10:49', '2010-06-25 18:10:49')
---
  def create
    @activity = Activity.new(params[:activity])

    respond_to do |format|
      if @activity.save