rails/app/controllers/questions_controller.rb

  def index
    @questions = Question.all
---
SELECT * FROM "questions"

  def show
    @question = Question.find(params[:id])
---
SELECT * FROM "questions" WHERE ("questions"."id" = 1)

  def edit
    @question = Question.find(params[:id])
---
SELECT * FROM "questions" WHERE ("questions"."id" = 1)

  def create
    @question = Question.new(params[:question])

    respond_to do |format|
      if @question.save
---
INSERT INTO "questions" ("prompt", "activity_id", "created_at", "updated_at") VALUES('Run as fast as you can and jump as high as you can. Repeat.', 1, '2010-06-25 18:12:12', '2010-06-25 18:12:12')